app/Http/Controllers/ClienteController.php

select * from `humano` where `nombres` LIKE '%%' and `tipo_de_humano` = 'Cliente' or `n_documento` LIKE '%%' and `tipo_de_humano` = 'Cliente' order by `id_humano` desc limit 10 offset 0
select count(*) as aggregate from `humano` where `nombres` LIKE '%%' and `tipo_de_humano` = 'Cliente' or `n_documento` LIKE '%%' and `tipo_de_humano` = 'Cliente'
---
    public function index(Request $request)
    {
        if ($request) {
            $query = trim($request->get('searchText'));
            $humano = DB::table('humano')
                ->where('nombres', 'LIKE', '%' . $query . '%')
                ->where('tipo_de_humano', '=', 'Cliente')
                ->orwhere('n_documento', 'LIKE', '%' . $query . '%')
                ->where('tipo_de_humano', '=', 'Cliente')
                ->orderBy('id_humano', 'desc')
                ->paginate(10);