app/Http/Controllers/HabitController.php

    public function index(Request $request)
    {
        if ($request) {
            $query = trim($request->get('searchText'));
            $Habitaciones = DB::table('habitacion as h')
                ->join('tipodehabitacion as t', 'h.id_tipodehabitacion', '=', 't.id_tipodehabitacion')
                ->select('h.id_habitacion', 'h.nombre_n_habitacion', 't.nombredeltipo as tipohabitacion', 'h.estado')
                ->where('h.nombre_n_habitacion', 'LIKE', '%' . $query . '%')
                ->orderBy('id_habitacion', 'asc')
                ->paginate(10);
---
select `h`.`id_habitacion`, `h`.`nombre_n_habitacion`, `t`.`nombredeltipo` as `tipohabitacion`, `h`.`estado` from `habitacion` as `h` inner join `tipodehabitacion` as `t` on `h`.`id_tipodehabitacion` = `t`.`id_tipodehabitacion` where `h`.`nombre_n_habitacion` LIKE '%%' order by `id_habitacion` asc limit 10 offset 0
select count(*) as aggregate from `habitacion` as `h` inner join `tipodehabitacion` as `t` on `h`.`id_tipodehabitacion` = `t`.`id_tipodehabitacion` where `h`.`nombre_n_habitacion` LIKE '%%'