app/Http/Controllers/HomeController.php

select `h`.`id_habitacion`, `h`.`nombre_n_habitacion`, `t`.`nombredeltipo` as `tipohabitacion`, `h`.`estado` from `habitacion` as `h` inner join `tipodehabitacion` as `t` on `h`.`id_tipodehabitacion` = `t`.`id_tipodehabitacion` order by `id_habitacion` asc
---
    public function index()
    {
        $Habitaciones = DB::table('habitacion as h')
            ->join('tipodehabitacion as t', 'h.id_tipodehabitacion', '=', 't.id_tipodehabitacion')
            ->select('h.id_habitacion', 'h.nombre_n_habitacion', 't.nombredeltipo as tipohabitacion', 'h.estado')
            ->orderBy('id_habitacion', 'asc');

        $Habitaciones = $Habitaciones->get();