app/Http/Controllers/ProductoController.php

select * from `producto` where `nombre_producto` LIKE '%%' and `eliminado` = '1' order by `id_producto` desc limit 10 offset 0
select count(*) as aggregate from `producto` where `nombre_producto` LIKE '%%' and `eliminado` = '1'
---
    public function index(Request $request)
    {
        if ($request) {
            $query = trim($request->get('searchText'));
            $productos = DB::table('producto')->where('nombre_producto', 'LIKE', '%' . $query . '%')
                ->where('eliminado', '=', '1')
                ->orderBy('id_producto', 'desc')
                ->paginate(10);