app/Http/Controllers/TipohabController.php

    public function index(Request $request)
    {
        if ($request) {
            $query = trim($request->get('searchText'));
            $Tipos = DB::table('tipodehabitacion')->where('nombredeltipo', 'LIKE', '%' . $query . '%')
                ->where('eliminado', '=', '1')
                ->orderBy('id_tipodehabitacion', 'asc')
                ->paginate(10);
---
select * from `tipodehabitacion` where `nombredeltipo` LIKE '%%' and `eliminado` = '1' order by `id_tipodehabitacion` asc limit 10 offset 0
select count(*) as aggregate from `tipodehabitacion` where `nombredeltipo` LIKE '%%' and `eliminado` = '1'